app/controllers/admins/items_controller.rb

  def index
    @items = Item.page(params[:page]).per(10)
---
SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def create

    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO "items" ("name", "non_taxed_price", "items_explanation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "as"], ["non_taxed_price", 0], ["items_explanation", "wer"], ["created_at", "2021-08-22 10:47:42.544362"], ["updated_at", "2021-08-22 10:47:42.544362"]]

  def edit
    @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]